[{"_id":"62eafc0adeebab2c7f17aeae","name":"Dosa","description":"1. Take all the ingredients to prepare the dosa batter. Rice, urad dal and fenugreek seeds are the main ingredients. Chana dal is used for getting a golden color for Dosa.\n\n2. Rinse both types of rice (regular rice and parboiled rice) together in water for 3-4 times and soak them in 2 cups of water for 4-5 hours – (Place both types of rice in a medium-size bowl and fill it with water till 3/4th height. Rinse the rice by rubbing them between your fingertips; the water will turn cloudy. Drain the water and repeat the process 3-4 times).\n\n3. Rinse urad dal and chana dal together in water, add fenugreek seeds and soak in 1 cup water for 4-5 hours.\n\n4. Drain water from urad dal in a small bowl and reserve it (it will be used in the next step while grinding the dal). Add drained urad dal, chana dal and fenugreek seeds mixture in the medium jar of a mixer grinder or blender.\n\n5. Take all the ingredients to prepare the dosa batter. Rice, urad dal and fenugreek seeds are the main ingredients. Chana dal is used for getting a golden color for Dosa.\n","cover":"https://firebasestorage.googleapis.com/v0/b/yummy-web-4a730.appspot.com/o/recipie%2Fade543bb-858f-4bda-966b-2e8e2a7b0807?alt=media&token=438a613f-76c7-4c33-b783-e1a8ec8a5f71","ingredients":["½ cup idli rice","½ cup regular rice","¼ cup urad dal","oil","water","⅛ teaspoon fenugreek seeds","¼ cup urad dal "],"timeTaken":30,"author":"62eaf973dbd0293cb98a3d3e","__v":0},{"_id":"62eafe28deebab2c7f17aecc","name":"Aloo Paratha","description":"1. First, boil or steam 4 medium-sized potatoes in a pressure cooker, steamer or electric cooker. Add enough water in a 2-litre pressure cooker or pan to just barely cover the potatoes.\n\n2. If you haven’t done so yet, peel and chop the warm potatoes. Then mash the potatoes with a potato masher.\n\n3. The potatoes should be mashed very well, with no lumps, chunks or bits. Any lumps in the mix will cause the stuffing to leak out of the dough when rolling.\n\n4. Now add the following ingredients, feeling free to vary the spices as you like.\n\n5. With a spoon, thoroughly mix the spice powders and green chilies into the mashed potatoes. Check the taste of the spiced mashed potato stuffing, adjusting the salt, red chilli powder, or dry mango powder if required. Set the prepared aloo stuffing aside.\n\n6. In a separate bowl, add 2 cups whole wheat flour. Make a well in the center. Add ½ teaspoon salt (or to taste), 1 tablespoon oil or ghee, and roughly ⅓ to ½ cup water.\n\n7. Bring the mixture together and knead into a smooth, soft dough for 8 to 10 minutes. Add more water if needed. Cover and keep the dough aside, letting it rest for 20 to 30 minutes.\n\n8. Pinch two small balls from the dough. Flatten them and dust with whole wheat flour.\n\n9. With a rolling pin, roll them into rounds roughly 4 to 5 inches in diameter. Try making both the discs the same size.\n\n10. On one of the discs, place the potato stuffing in the center, keeping about 1 inch empty space from the sides.\n\n11. Gently place the second circle on top.\n\n12. Press and seal the edges with your fingertips. If you are not able to seal the edges, then brush or spread some water on the edges and then seal.\n\n13. Dust some flour on the stuffed aloo ka paratha and start rolling.\n\n14. Roll the paratha into a round about 7 to 8 inches in diameter, or about the size of a normal roti or chapati.\n\n","cover":"https://firebasestorage.googleapis.com/v0/b/yummy-web-4a730.appspot.com/o/recipie%2F8ff23763-9969-463d-bab3-64716ccc490e?alt=media&token=ddf5a7ee-5452-4512-8cbd-e474588eab5c","ingredients":["Dough made from whole wheat flour","Mashed potato stuffing"],"timeTaken":20,"author":"62eaf973dbd0293cb98a3d3e","__v":0},{"_id":"62eaffe1deebab2c7f17aeee","name":"Pani Puri","description":"1. Boil the potatoes till they are cooked completely.\n\n2. Boil the potatoes till they are cooked completely.\n\n3. Finely chop the onion if using it.\n\n4. In a small bowl, mix the potatoes, onions, coriander leaves, cumin powder, chaat masala powder and black salt or regular salt. Mix well and keep aside.\n\n5. In a blender add all the ingredients mentioned above for the pani.\n\n6. Remove the green chutney in a large bowl. Rinse the mixer jar with ½ cup water first and then add this water in the bowl. Then add ½ to ¾ cup more water.\n\n7. Add the boondi to the pani.\n\n8. You can also make individual portions with the puris, potato-onion mixture and the pani. Let the individual assemble the pani puri for himself/herself as per his/her taste.\n\n9. Serve the pani puri immediately otherwise the prepared puri with stuffing and water will become soggy.\n","cover":"https://firebasestorage.googleapis.com/v0/b/yummy-web-4a730.appspot.com/o/recipie%2F39e724a1-5d54-4361-9fcc-db09dcd49240?alt=media&token=e10ff21c-ba91-4616-ba7f-e1e33418a4f1","ingredients":["Potatoes","1 to 1.5 tablespoons chopped coriander leaves","1 teaspoon roasted cumin powder","1 teaspoon chaat masala powder","¼ teaspoon red chili powder – optional","black salt or regular salt"],"timeTaken":35,"author":"62eaf973dbd0293cb98a3d3e","__v":2},{"_id":"62eb01d3deebab2c7f17af13","name":"Rajma","description":"1. Heat oil + butter in another pot or pan on a low heat. Add cumin first and let them crackle & get browned.\n\n2. Then add onions and sauté them till they caramelized or golden browned on a medium-low to medium heat.\n\n3. Take care not to burn them as this will give bitter tones in the curry.\n\n4. Light browning the onions is also alright.\n\n5. Keep on stirring the onions while sauteing them, for uniform cooking and also so that they don't get burnt.\n\n6. On a medium-low heat or medium heat stirring often sauté the whole masala mixture until the fat starts leaving the sides of the masala base. This masala paste will become glossy, thicken and leave the sides of the pan.\n\n7. Stir and sauté for a minute.\n","cover":"https://firebasestorage.googleapis.com/v0/b/yummy-web-4a730.appspot.com/o/recipie%2F061e3362-960c-4193-b43e-89815aa7f22c?alt=media&token=359e6e0d-dd2c-4e77-b109-c98e2ff60384","ingredients":["1 cup rajma","water","garlic cloves","ginger","green chillies","2 tablespoons Butter","1 cup finely chopped tomatoes"],"timeTaken":45,"author":"62eaf973dbd0293cb98a3d3e","__v":0},{"_id":"62eb0363deebab2c7f17af81","name":"Chocolate Cookie","description":"1. In a mixing bowl take unsalted butter, brown sugar, raw sugar, vanilla extract and milk. Grease a baking tray or line it with a parchment paper.\n\n2. Using a wired whisk or an electric beater begin to mix and whip the ingredients.\n\n3. Whip till the butter becomes nicely soft and fluffy.\n\n4. Place a sieve on top of the bowl. Add whole wheat flour, baking powder and teaspoon salt into the sieve. Make sure that the bottom of the sieve does not touch the whipped butter. You can also sift the flour separately.\n\n5. With a spatula, gently begin to fold the sifted flour into the whipped butter.\n\n6. Fold well. The cookie dough will be sticky.\n\n7. Add chocolate chips.\n\n8. Take a portion of dough and lightly roll or flatten on tray or use a cookie press or a scoop a tablespoon from the dough.\n\n9. Keep some space around the cookies as they flatten while baking.\n\n10. Preheat oven at 190 degrees celsius (374 degrees Fahrenheit) for 20 minutes. For an OTG, keep both the heating elements on. Place the cookie tray in the center of the oven.\n\n11. Using a spatula, remove the cookies from the tray and place them on a wired rack. Let the cookies cool completely before storing or serving.\n\n12. Serve eggless chocolate chip cookies as a sweet snack.","cover":"https://firebasestorage.googleapis.com/v0/b/yummy-web-4a730.appspot.com/o/recipie%2Ffc1d29b2-bae7-419c-94c2-5d342083dba7?alt=media&token=da6502f7-4cf2-4881-8a3b-6204afcdba95","ingredients":["100 grams unsalted butter – softened","¼ cup tightly packed brown sugar – 50 grams","¼ cup raw sugar – 50 grams, can use castor sugar or finely granulated white sugar","1 teaspoon vanilla extract or ½ teaspoon vanilla essence","¼ cup whole milk"],"timeTaken":50,"author":"62eaf973dbd0293cb98a3d3e","__v":0},{"_id":"62eb04a3deebab2c7f17af9d","name":"Samosa","description":"1. Take the flour, carom seeds, salt in a bowl. Mix well and add ghee.\n\n2. With your fingertips rub the ghee or oil in the flour to get a breadcrumb like consistency.\n\n3. The whole mixture should clump together when joined and not fall apart.\n\n4. Add water in parts and knead to a firm dough.\n\n5. If the dough looks dry or floury, then add 1 to 2 tablespoons more water and knead.\n\n6. Cover the dough with a moistened napkin and set aside for 30 minutes.\n\n7. Steam or boil the potatoes and peas till are cooked completely. Drain them of any extra water in a colander or sieve.\n\n8. Dry roast all the whole spices mentioned in the above list until fragrant taking care not to burn them.\n\n9. Set aside the potato filling aside to cool at room temperature.\n\n10. Join the two straight ends forming a cone shape.\n\n11. Press both the edges. Be sure there are no cracks.\n\n12. Now heat oil for deep frying in a kadai or pan. Once the oil becomes hot (test by adding a small piece of dough – it should come up quickly once added to the hot oil). Gently slide the prepared stuffed samosa & quickly reduce the flame to low.\n\n13. Add the samosa and then lower the flame, thereby decreasing the temperature of oil.\n\n14. Serve samosa hot or warm with coriander chutney, tamarind chutney or tomato ketchup.","cover":"https://firebasestorage.googleapis.com/v0/b/yummy-web-4a730.appspot.com/o/recipie%2Fa95dd007-af07-4096-a42a-7074e12a132f?alt=media&token=a0d9461c-6070-4c3d-83ce-5dc9339c7c2a","ingredients":["½ inch cinnamon","2 cups all-purpose flour (maida), 250 grams","1 teaspoon carom seeds","1 teaspoon salt or add as required","6 tablespoons Ghee (clarified butter), 50 grams","2 cups water – for steaming"],"timeTaken":45,"author":"62eaf973dbd0293cb98a3d3e","__v":0}]